<template>
  <div demo-bg><dv-scroll-board :config="config" /></div>
</template>
<script lang="ts" setup>
import { reactive } from "vue";
const config = reactive({
  header: ["工序", "项目", "管控范围", "实际参数"],
  data: [
    ["外层", "传送速度", "2000mm/min", "2000±1000mm/min"],
    ["外层", "微蚀浓度", "H2SO4：90g/L", "H2SO4：90±20g/L"],
    ["外层", "微蚀浓度", "H2O2:35g/L", "H2O2:35±15g/L"],
    ["外层", "微蚀浓度", "Cu2+:≤35g/L", "Cu2+:≤35g/L"],
    ["外层", "微蚀温度", "30℃", "30±2℃"],
    ["外层", "微蚀压力", "1.3kg/cm2", "1.3±0.3kg/cm2"],
    ["外层", "微蚀速率", "25U″", "25±5U″"],
    ["外层", "水破", "≥15秒", "≥15秒"],
    ["外层", "压膜温度", "110℃", "110±10℃"],
    ["外层", "压膜压力", "0.4mpa", "0.4±0.1mpa"],
    ["外层", "贴膜气缸压力", "0.25-0.4mpa", "0.25-0.4mpa"],
    ["外层", "上下干膜煞车气缸压力", "0.2mpa", "0.2±0.1mpa"],
    ["外层", "压膜速度", "2.0m/min", "2.0±1m/min"],
    ["外层", "二段压膜温度", "110℃", "110±10℃"],
    ["外层", "二段压膜压力", "0.4mpa", "0.4±0.1mpa"],
    ["外层", "气压", "0.4mpa", "0.3-0.5mpa"],
    ["外层", "热压轮寿命", "1200小时", "≤1200小时"],
    ["外层", "切刀更换", "12万次", "≤12万次"],
    ["外层", "贴膜压条更换", "15万次", "≤15万次"],
    ["外层", "真空滤器芯更换", "1500小时", "≤1500小时"],
    ["外层", "贴膜时间", "1-3 秒", "1-3 秒"],
    ["外层", "贴膜温度", "40℃", "40±10℃"],
    ["外层", "前后留铜", "0-7mm", "0-7mm"],
    ["外层", "粘尘纸卷切割", "≤100片", "≤120片"],
    ["外层", "粘尘机压力", "0.4-0.6mpa", "0.4-0.6mpa"],
    ["外层", "粘尘机速度", "30-40", "30-40"],
    [
      "外层",
      "压膜轮压痕迹测试",
      "每天一次或更换压膜轮时测试",
      "每天一次或更换压膜轮时测试",
    ],
    ["外层", "能量尺", "5-7格", "21格能量尺"],
    ["外层", "台面真空(mmHg)", "≤-5", "真空表"],
    ["外层", "冰水机温度", "20℃±1℃", "温度表"],
    ["外层", "pe预警值", "0.05mm", "机台设定"],
    ["外层", "Pe水平阀值", "0.08mm", "机台设定"],
    ["外层", "Pe竖直阀值", "0.08mm", "机台设定"],
    ["外层", "Pe斜边阀值", "0.14mm", "机台设定"],
    ["外层", "BSAPE阈值", "0.05mm", "机台设定"],
    ["外层", "PCB板厚阈值", "0.05mm", "机台设定"],
    ["外层", "自动标定间隔时间", "12小时", "目视"],
    ["外层", "压力", "1.5kg/cm2", "1.5±0.3kg/cm2"],
    ["外层", "显影点", "50%", "50±10%"],
    ["外层", "温度", "30℃", "30±2℃"],
    ["外层", "浓度", "12g/L", "12±2g/L"],
    ["外层", "速度", "3500mm/min", "3500±1000mm/min"],
    ["外层", "流量", "300L/H", "300±60L/H"],
    ["外层", "压力", "上:3.0±0.5kg/cm2", "上:3.0±0.5kg/cm2"],
    ["外层", "压力", "下:2.5±0.5kg/cm2", "下:2.5±0.5kg/cm2"],
    ["外层", "温度", "50±5℃", "50±5℃"],
    ["外层", "浓度", "酸碱度0.4", "0.1-1"],
    ["外层", "浓度", "SG. 1.325", "SG. 1.29-1.36"],
    ["外层", "浓度", "Cu2：5%", "Cu2：4%-6%"],
    ["外层", "速度", "铜厚", "速度", "首件确认"],
    ["外层", "速度", "32-45um", "4000±1000mm/min", "4000mm/min"],
    ["外层", "均匀性", "上压≥85%下压≥90%", "上压≥85%下压≥90%"],
    ["外层", "蚀刻因子", "≥3", "≥3"],
    ["外层", "车间温度", "22±2℃", "22.1℃"],
    ["外层", "车间湿度", "55±5℃", "54.2℃"],
    ["AOI", "车间温度", "23±3℃", "22.9℃"],
    ["AOI", "车间湿度", "40±20℃", "33.9℃"],
    ["外层", "落尘量", "小于10000级", "6543级"],
  ],
  align: ["left"],
  rowNum: [3],
  headerBGC: ["transparent"],
  evenRowBGC: ["transparent"],
  oddRowBGC: ["#026CCA80"],
});
</script>

<style scoped lang="scss">
:deep(.dv-scroll-board) {
  .header {
    font-size: 0.2rem;
    background-color: transparent !important;
    > div {
      width: 30% !important;
    }
    > :nth-child(1) {
      width: 10% !important;
    }
    .header-item {
      text-align: center;
      padding: 0;
    }
  }

  .rows {
    .row-item {
      padding: 0;
      font-size: 0.15rem;
      border-radius: 0.1rem;
      > div {
        width: 30% !important;
      }
      > :nth-child(1) {
        width: 10% !important;
      }
      .ceil {
        padding: 0;
        text-align: center;
      }
    }
  }
}
</style>
