<template>
  <div demo-bg>
    <dv-scroll-board :config="config" style="height: 2.8rem" />
  </div>
</template>
<script lang="ts" setup>
import { reactive } from "vue";
const config = reactive({
  header: ["设备", "报警记录", "报警时间"],
  data: [
    ["一次棕化线1", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线2", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线3", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线4", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线5", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线6", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线7", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线8", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线9", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线10", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线11", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线12", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线13", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
    ["一次棕化线14", "棕化添加缸3液位过低请检查", "2025/3/24 19:36:43"],
  ],
  index: true,
  columnWidth: [50],
  align: ["center"],
  rowNum: [4],
  headerBGC: ["transparent"],
  oddRowBGC: ["transparent"],
});
</script>
<style scoped lang="scss">
:deep(.dv-scroll-board) {
  .header {
    .header-item {
      text-align: center;
    }
  }

  .rows {
    .row-item {
      .ceil {
        text-align: center;
      }
    }
  }
}
</style>
