<template>
  <div demo-bg><dv-scroll-board :config="config" /></div>
</template>
<script lang="ts" setup>
import { reactive } from "vue";
const config = reactive({
  header: ["工序", "项目", "管控范围", "实际参数"],
  data: [
 
      ["防焊丝印", "温度", "22±2℃", "22.6℃"],
      ["防焊曝光", "温度", "22±2℃", "21.7℃"],
      ["菲林房", "温度", "22±2℃", "21.8℃"],
      ["网房", "温度", "22±2℃", "22.3℃"],
      ["防焊丝印", "湿度", "55±5%", "57.60%"],
      ["防焊曝光", "湿度", "55±5%", "54.50%"],
      ["菲林房", "湿度", "55±5%", "56.60%"],
      ["网房", "湿度", "55±5%", "57.60%"],
      ["菲林房", "落尘量", "1000级", "950级"],
      ["防焊丝印", "落尘量", "10000级", "9000级"],
      ["防焊曝光", "落尘量", "5000级", "4900级"],
      ["防焊前处理", "酸洗浓度", "H2So4:5±1%", "H2So4:5%"],
      ["防焊前处理", "酸洗温度", "30±2℃", "30.8℃"],
      ["防焊前处理", "水洗压力", "1.5±0.5kg/cm2", "1.5 kg/cm2"],
      ["防焊前处理", "中粗化浓度", "90g±20g/L", "90g/L"],
      ["防焊前处理", "烘干温度", "90℃±5℃", "91℃"],
      ["防焊前丝印", "机台气压", "0.5±0.2MPA", "0.5MPA"],
      ["防焊前丝印", "预烤温度", "75±3℃", "75℃"],
      ["防焊前丝印", "预烤时间", "50±5min", "50min"],
      ["防焊曝光", "能量均匀性", "Min/max:≥80%", "Min/max:≥80%"],
      ["防焊曝光", "曝光能量", "6-9格", "8格"],
      ["防焊曝光", "灯管寿命", "≤1500H", "≤1500H"],
      ["防焊曝光", "菲林清洁频率", "40PNL/次", "40PNL/次"],
      ["防焊显影", "显影速度", "3.0±0.5m/min", "3.0m/min"],
      ["防焊显影", "浓度", "12±2g/l", "12g/l"],
      ["防焊显影", "显影压力", "1.5±0.5kg/cm2", "1.5kg/cm2"],
      ["防焊显影", "水洗压力", "1.0±0.5kg/cm2", "1.0kg/cm2"],
      ["文字印刷", "油墨使用寿命", "≤16小时", "≤16小时"],
      ["文字印刷", "丝印机总气压", "0.7±0.2mpa", "0.7mpa"],
      ["文字印刷", "刮刀压力", "0.3±0.1mpa", "0.3mpa"],
      ["文字印刷", "刮刀速度", "6±3格", "6格"],
      ["文字后烘", "烘烤温度", "150±5℃", "150℃"],
      ["文字后烘", "后烤时间", "60±5min", "60min"],
      ["文字网房", "曝光真空度", "-450±50mmHg", "-450mmHg"],
      ["文字网房", "拉网压力", "7.0±0.5kg/cm2", "7.0kg/cm2"],
      ["文字网房", "烘网温度", "40±5℃", "40℃"],
      ["文字网房", "烘网时间", "30±10min", "30min"],
      ["文字网房", "曝光灯寿命", "三个月", "三个月"],
  ],
  align: ["left"],
  rowNum: [3],
  headerBGC: ["transparent"],
  evenRowBGC: ["transparent"],
  oddRowBGC: ["#026CCA80"],
});
</script>

<style scoped lang="scss">
:deep(.dv-scroll-board) {
  .header {
    font-size: 0.15rem;
    background-color: transparent !important;
    > div {
      width: 28% !important;
    }
    > :nth-child(1) {
      width: 16% !important;
    }
    .header-item {
      text-align: center;
    }
  }

  .rows {
    .row-item {
      padding: 0;
      font-size: 0.2rem;
      border-radius: 0.1rem;
      > div {
        width: 28% !important;
      }
      > :nth-child(1) {
        width: 16% !important;
      }
      .ceil {
        padding: 0;
        text-align: center;
      }
    }
  }
}
</style>
