<template>
  <div demo-bg><dv-scroll-board :config="config" /></div>
</template>
<script lang="ts" setup>
import { reactive } from "vue";
const config = reactive({
  header: ["设备名称", "槽体", "过程", "设定值", "控制范围"],
  data: [
    ["VCP线", "常温槽", "温度", "25℃", "25±2℃"],
    ["VCP线", "清洁槽", "温度", "30℃", "30±3℃"],
    ["VCP线", "水洗槽", "溢流", "5L/min", "5±1L/min"],
    ["VCP线", "预浸槽", "H2SO4", "10g/L", "10g/L"],
    ["VCP线", "铜槽", "过滤机压力", "1kg", "1±0.5kg"],
    ["VCP线", "铜槽", "铜槽喷流流量", "40m3/h", "20-50m3/h"],
    ["VCP线", "铜槽", "铜槽温度", "24℃", "24±2℃"],
    ["VCP线", "铜槽", "CUSO4", "60g/l", "60±10g/l"],
    ["VCP线", "铜槽", "CL-", "60PPM", "40-70PPM"],
    ["VCP线", "铜槽", "H2SO4", "240g/l", "240±20g/l"],
    ["VCP线", "铜槽", "湿润剂（172544）", "10/L", "10±3 ml/L"],
    ["VCP线", "铜槽", "柔软剂（172546）", "6/L", "6±3 ml/L"],
    ["VCP线", "铜槽", "光泽剂（172545）", "0.8/L", "0.8±3 ml/L"],
    ["电镀后处理", "传送", "传送速度", "2.0m/min", "2.0±1.0m/min"],
    ["电镀后处理", "酸洗", "水洗压力", "1.5kg/cm", "1.5±0.2kg/cm"],
    ["电镀后处理", "磨刷", "工作电流", "2.95A", "2.95±0.55A"],
    ["电镀后处理", "磨刷", "刷幅", "10mm", "10±2mm"],
    ["电镀后处理", "磨刷", "摆动频率", "220cycle/min", "220±10cycle/min"],
    ["电镀后处理", "磨刷", "刷毛长度", "＞8mm", "＞8mm"],
    ["电镀后处理", "水洗", "水洗流量", "300L/H", "300±60L/H"],
    ["电镀后处理", "水洗", "水洗压力", "1.6kg/cm2", "1.3±0.3kg/cm2"],
    ["电镀后处理", "热风吹干", "温度", "90℃", "90±5℃"],
    ["日蚀线", "膨松", "温度", "75℃", "75±3℃"],
    ["日蚀线", "膨松", "超音波功率", "＞70%", "＞70%"],
    ["日蚀线", "膨松", "超音波频率", "＞20KHZ", "＞20KHZ"],
    ["日蚀线", "膨松", "M-ATAQ 179220", "0.3", "0.3"],
    ["日蚀线", "膨松", "氢氧化钠", "0.04", "3-5%"],
    ["日蚀线", "除胶渣", "温度", "80±3℃", "80±3℃"],
    ["日蚀线", "除胶渣", "再生机电流", "生产时：1500±100A", "1500±100A"],
    ["日蚀线", "除胶渣", "超音波功率", "＞75%", "＞75%"],
    ["日蚀线", "除胶渣", "超音波频率", "＞20KHZ", "＞20KHZ"],
    ["日蚀线", "除胶渣", "高锰酸钾", "45 g/L", "45-70 g/L"],
    ["日蚀线", "除胶渣", "副产物", "＜25 g/L", "＜25 g/L"],
    ["日蚀线", "除胶渣", "119276", "0.046", "4.3-5.7%"],
    ["日蚀线", "除胶渣", "除胶速率", "10-40mg/dm2", "15-35 mg/dm2"],
    ["日蚀线", "中和", "温度", "25℃", "25±3℃"],
    ["日蚀线", "中和", "压力表压力", "0.2 kg/cm2", "0.2±0.1kg/cm2"],
    ["日蚀线", "中和", "中和剂179225", "1-2%", "1.0-1.8%"],
    ["日蚀线", "中和", "H2SO4", "6-10%", "6.5-9.5%"],
    ["日蚀线", "中和", "中和速率", "10-40μ”", "15-35μ”"],
    ["日蚀线", "中和", "Cu2+", "≤30g/L", "≤30g/L"],
    ["日蚀线", "除油", "温度", "54℃", "54±3℃"],
    ["日蚀线", "除油", "超声波功率", "＞70%", "＞70%"],
    ["日蚀线", "除油", "超音波频率", "＞20KHZ", "＞20KHZ"],
    ["日蚀线", "除油", "压力表压力", "0.2 kg/cm2", "0.2±0.1kg/cm2"],
    ["日蚀线", "除油", "115759", "0.05", "0.05"],
    ["日蚀线", "日蚀", "温度", "32℃", "32±3℃"],
    ["日蚀线", "日蚀", "压力表压力", "0.2 kg/cm2", "0.2±0.1kg/cm2"],
    ["日蚀线", "日蚀", "固形物百分比", "1.6-2.0%", "1.6-2.0%"],
    ["日蚀线", "日蚀", "115756", "0.16", "0.16"],
    ["日蚀线", "日蚀", "PH", "9.6", "9.6-10.4"],
    ["日蚀线", "微蚀", "微蚀速率", "40μ”", "40±10μ”"],
    ["日蚀线", "烘干", "温度", "80±3℃", "80±3℃"],
  ],
  align: ["left"],
  rowNum: [3],
  headerBGC: ["transparent"],
  evenRowBGC: ["transparent"],
  oddRowBGC: ["#026CCA80"],
});
</script>

<style scoped lang="scss">
:deep(.dv-scroll-board) {
  .header {
    font-size: 0.2rem;
    background-color: transparent !important;
    // > div {
    //   width: 16.8% !important;
    // }
    // > :nth-child(4) {
    //   width: 8% !important;
    // }
    // > :nth-child(6) {
    //   width: 8% !important;
    //   text-align: center;
    // }

    .header-item {
      text-align: center;
      padding: 0;
    }
  }

  .rows {
    .row-item {
      padding: 0;
      font-size: 0.16rem;
      border-radius: 0.1rem;
      //   > div {
      //     width: 16.8% !important;
      //   }
      //   > :nth-child(4) {
      //     width: 8% !important;
      //   }
      //   > :nth-child(6) {
      //     width: 8% !important;
      //     text-align: center;
      //   }
      .ceil {
        padding: 0;
        text-align: center;
      }
    }
  }
}
</style>
