<template>
  <div demo-bg>
    <dv-scroll-board :config="config" style="height: 10rem" />
  </div>
</template>
<script lang="ts" setup>
import { reactive } from "vue";
const config = reactive({
  header: ["工序", "设备名称", "保养频率", "本次保养时间", "下次保养时间"],
  data: [
  ["开料", "裁切机", "1次/周", "2025年3月27日", "2025年4月4日"],
  ["开料", "铝基板开料机", "1次/周", "2025年3月27日", "2025年4月4日"],
  ["开料", "磨边线", "1次/周", "2025年3月27日", "2025年4月4日"],
  ["开料", "烤箱", "1次/周", "2025年3月27日", "2025年4月4日"],
  ["钻孔", "上PIN机", "1次/月", "2025年3月3日", "2025年4月3日"],
  ["钻孔", "机械钻机1#", "1次/月", "2025年3月3日", "2025年4月3日"],
  ["钻孔", "机械钻机2#", "1次/月", "2025年3月4日", "2025年4月4日"],
  ["钻孔", "机械钻机3#", "1次/月", "2025年3月5日", "2025年4月5日"],
  ["钻孔", "机械钻机4#", "1次/月", "2025年3月6日", "2025年4月6日"],
  ["钻孔", "机械钻机5#", "1次/月", "2025年3月7日", "2025年4月7日"],
  ["钻孔", "机械钻机6#", "1次/月", "2025年3月8日", "2025年4月8日"],
  ["钻孔", "机械钻机7#", "1次/月", "2025年3月9日", "2025年4月9日"],
  ["钻孔", "机械钻机8#", "1次/月", "2025年3月10日", "2025年4月10日"],
  ["钻孔", "机械钻机9#", "1次/月", "2025年3月11日", "2025年4月11日"],
  ["钻孔", "机械钻机10#", "1次/月", "2025年3月12日", "2025年4月12日"],
  ["钻孔", "验孔机", "1次/月", "2025年3月13日", "2025年4月13日"],
  ["钻孔", "研磨机1#", "1次/月", "2025年3月14日", "2025年4月14日"],
  ["钻孔", "研磨机2#", "1次/月", "2025年3月15日", "2025年4月15日"],
  ["钻孔", "研磨机3#", "1次/月", "2025年3月16日", "2025年4月16日"],
  ["电镀", "日蚀线1#", "1次/周", "2025年3月27日", "2025年4月4日"],
  ["电镀", "日蚀线2#", "1次/周", "2025年3月28日", "2025年4月5日"],
  ["电镀", "VCP线1#", "1次/周", "2025年3月26日", "2025年4月3日"],
  ["电镀", "VCP线2#", "1次/周", "2025年3月27日", "2025年4月4日"],
  ["电镀", "磨板机", "1次/周", "2025年3月28日", "2025年4月5日"],
  ["线路", "前处理压膜1#", "1次/周", "2025年3月22日", "2025年3月29日"],
  ["线路", "前处理压膜2#", "1次/周", "2025年3月23日", "2025年3月30日"],
  ["线路", "前处理滚涂DI蚀刻连线1#", "1次/周", "2025年3月22日", "2025年3月29日"],
  ["线路", "前处理滚涂DI蚀刻连线2#", "1次/周", "2025年3月23日", "2025年3月30日"],
  ["线路", "手动曝光机1#", "1次/15天", "2025年3月15日", "2025年3月31日"],
  ["线路", "手动曝光机2#", "1次/15天", "2025年3月14日", "2025年3月30日"],
  ["线路", "LDI曝光连线", "1次/15天", "2025年3月13日", "2025年3月29日"],
  ["线路", "蚀刻线1#", "1次/周", "2025年3月23日", "2025年3月30日"],
  ["线路", "蚀刻线2#", "1次/周", "2025年3月22日", "2025年3月29日"],
  ["AOI", "AOI+VRS1#", "1次/周", "2025年3月25日", "2025年4月1日"],
  ["AOI", "AOI+VRS2#", "1次/周", "2025年3月26日", "2025年4月2日"],
  ["AOI", "AOI+VRS3#", "1次/周", "2025年3月27日", "2025年4月3日"],
  ["菲林房", "光绘机1#", "1次/周", "2025年3月3日", "2025年3月10日"],
  ["菲林房", "光绘机2#", "1次/周", "2025年3月4日", "2025年3月11日"],
  ["菲林房", "底片检查机", "1次/周", "2025年3月5日", "2025年3月12日"],
  ["防焊", "前处理1#", "1次/周", "2025年3月6日", "2025年3月13日"],
  ["防焊", "前处理2#", "1次/周", "2025年3月7日", "2025年3月14日"],
  ["防焊", "前处理3#", "1次/周", "2025年3月8日", "2025年3月15日"],
  ["防焊", "半自动丝印机1#", "1次/周", "2025年3月9日", "2025年3月16日"],
  ["防焊", "半自动丝印机2#", "1次/周", "2025年3月10日", "2025年3月17日"],
  ["防焊", "半自动丝印机3#", "1次/周", "2025年3月11日", "2025年3月18日"],
  ["防焊", "自动印刷机", "1次/周", "2025年3月12日", "2025年3月19日"],
  ["防焊", "隧道烤箱", "1次/周", "2025年3月13日", "2025年3月20日"],
  ["防焊", "ORC曝光机1#", "1次/周", "2025年3月14日", "2025年3月21日"],
  ["防焊", "ORC曝光机2#", "1次/周", "2025年3月15日", "2025年3月22日"],
  ["防焊", "滚涂预烤连线1#", "1次/周", "2025年3月16日", "2025年3月23日"],
  ["防焊", "滚涂预烤连线2#", "1次/周", "2025年3月17日", "2025年3月24日"],
  ["防焊", "科视曝光机", "1次/周", "2025年3月18日", "2025年3月25日"],
  ["防焊", "显影线1#", "1次/周", "2025年3月19日", "2025年3月26日"],
  ["防焊", "显影线2#", "1次/周", "2025年3月20日", "2025年3月27日"],
  ["文字", "手动丝印机1#", "1次/周", "2025年3月21日", "2025年3月28日"],
  ["文字", "手动丝印机2#", "1次/周", "2025年3月22日", "2025年3月29日"],
  ["文字", "手动丝印机3#", "1次/周", "2025年3月23日", "2025年3月30日"],
  ["文字", "手动丝印机4#", "1次/周", "2025年3月24日", "2025年3月31日"],
  ["文字", "手动丝印机5#", "1次/周", "2025年3月25日", "2025年4月1日"],
  ["文字", "手动丝印机6#", "1次/周", "2025年3月26日", "2025年4月2日"],
  ["文字", "隧道烤箱1#", "1次/周", "2025年3月27日", "2025年4月3日"],
  ["文字", "隧道烤箱2#", "1次/周", "2025年3月15日", "2025年4月4日"],
  ["文字", "拉网机", "1次/周", "2025年3月16日", "2025年4月5日"],
  ["文字", "上浆机", "1次/周", "2025年3月17日", "2025年4月6日"],
  ["文字", "曝光机", "1次/周", "2025年3月18日", "2025年4月7日"],
  ["整板压烤", "整板压烤1#", "1次/周", "2025年3月19日", "2025年4月8日"],
  ["整板压烤", "整板压烤2#", "1次/周", "2025年3月20日", "2025年4月9日"],
  ["成型", "成型机1#", "1次/月", "2025年3月21日", "2025年4月21日"],
  ["成型", "成型机2#", "1次/月", "2025年3月22日", "2025年4月22日"],
  ["成型", "成型机3#", "1次/月", "2025年3月23日", "2025年4月23日"],
  ["成型", "成型机4#", "1次/月", "2025年3月24日", "2025年4月24日"],
  ["成型", "成型机5#", "1次/月", "2025年3月25日", "2025年4月25日"],
  ["打码", "打码机", "1次/月", "2025年3月26日", "2025年4月26日"],
  ["冲型", "冲压机", "1次/月", "2025年3月27日", "2025年4月27日"],
  ["成型", "清洗线1#", "1次/月", "2025年3月22日", "2025年4月21日"],
  ["成型", "清洗线2#", "1次/月", "2025年3月23日", "2025年4月22日"],
  ["电测", "专用电测机1#", "1次/月", "2025年3月3日", "2025年4月3日"],
  ["电测", "专用电测机2#", "1次/月", "2025年3月3日", "2025年4月3日"],
  ["电测", "专用电测机3#", "1次/月", "2025年3月3日", "2025年4月3日"],
  ["电测", "专用电测机4#", "1次/月", "2025年3月3日", "2025年4月3日"],
  ["电测", "专用电测机5#", "1次/月", "2025年3月3日", "2025年4月3日"],
  ["电测", "专用电测机6#", "1次/月", "2025年3月3日", "2025年4月3日"],
  ["电测", "大台面专用测试机1#", "1次/月", "2025年3月2日", "2025年4月2日"],
  ["电测", "大台面专用测试机2#", "1次/月", "2025年3月2日", "2025年4月2日"],
  ["电测", "飞针机1#", "1次/月", "2025年3月4日", "2025年4月7日"],
  ["电测", "飞针机2#", "1次/月", "2025年3月4日", "2025年4月7日"],
  ["电测", "飞针机3#", "1次/月", "2025年3月4日", "2025年4月7日"],
  ["电测", "飞针机4#", "1次/月", "2025年3月4日", "2025年4月7日"],
  ["电测", "飞针机5#", "1次/月", "2025年3月4日", "2025年4月7日"],
  ["AVI", "AVI机1#", "1次/月", "2025年3月2日", "2025年4月2日"],
  ["AVI", "AVI机2#", "1次/月", "2025年3月2日", "2025年4月2日"],
  ["OSP", "OSP线1#", "1次/月", "2025年3月2日", "2025年4月2日"],
  ["OSP", "OSP线2#", "1次/月", "2025年3月3日", "2025年4月3日"],
  ["包装", "真空包装机", "1次/月", "2025年3月2日", "2025年4月2日"],
  ],
  index: true,
  columnWidth: [50],
  align: ["center"],
  rowNum: [15],
  headerBGC: ["transparent"],
  oddRowBGC: ["transparent"],
});
</script>

<style scoped lang="scss">
:deep(.dv-scroll-board) {
  .header {
    background-color: transparent !important;
    .header-item {
      text-align: center;
    }
  }

  .rows {
    .row-item {
      .ceil {
        text-align: center;
      }
    }
  }
}
</style>
