<template>
  <dv-scroll-board :config="config" style="width: 6.5rem; height: 3.875rem" />
</template>

<script setup lang="ts">
import { reactive } from "vue";
const config = reactive({
  header: ["线别", "保养频次", "今日保养"],
  data: [
    ["日蚀1线", "14天/次", "✅"],
    ["日蚀2线", "14天/次", "🕒"],
    ["日蚀3线", "14天/次", "✅"],
    ["日蚀4线", "14天/次", "✅"],
    ["VCP1线", "30天/次", "🕒"],
    ["VCP2线", "30天/次", "✅"],
    ["VCP3线", "30天/次", "✅"],
    ["VCP4线", "30天/次", "✅"],
    ["显影1线", "7天/次", "✅"],
    ["显影2线", "7天/次", "✅"],
    ["显影3线", "7天/次", "✅"],
    ["显影4线", "7天/次", "✅"],
    ["闪蚀1线", "30天/次", "✅"],
    ["闪蚀2线", "30天/次", "✅"],
    ["闪蚀3线", "30天/次", "✅"],
    ["闪蚀4线", "30天/次", "✅"],
  ],
  index: true,
  columnWidth: [50],
  align: ["center"],
});

// const config = reactive({
//   header: ["工号", "用户名称", "工位类别", "在岗课别"],
//   data: [
//     ["029541", "冉华宣", "电镀辅助", "添加铜粉", "B4"],
//     ["041302", "李明龙", "", "", "B4"],
//     ["036746", "姚增伟", "", "", "B4"],
//     ["044378", "汪威", "", "", "B4"],
//     ["018270", "孙红建", "", "", "B4"],
//     ["055210", "高军", "", "", "B4"],
//   ],
//   index: true,
//   columnWidth: [50],
//   align: ["center"],
// });
</script>

<style scoped lang="scss"></style>
