<template>
  <div class="jiangXiN2-container">
    <div><Title title="江西N2工厂智能展示" /></div>
    <div class="jiangXiN2-content">
      <div class="card">
        <EqualWidthScroll
          title="工厂设备保养/设备维护管控"
          svgName="maintenance"
          iconSize="0.5rem"
          titleFontSize="0.45rem"
          :rowNum="15"
          :headerFontSize="0.25"
          :header="[
            '工序',
            '设备名称',
            '保养频率',
            '本次保养时间',
            '下次保养时间',
          ]"
          :table-data="[
            ['开料', '裁切机', '1次/周', '2025年5月8日', '2025年5月15日'],
            ['开料', '铝基板开料机', '1次/周', '2025年5月9日', '2025年5月16日'],
            ['开料', '磨边线', '1次/周', '2025年5月10日', '2025年5月17日'],
            ['开料', '烤箱', '1次/周', '2025年5月11日', '2025年5月18日'],
            ['钻孔', '上PIN机', '1次/月', '2025年5月7日', '2025年6月7日'],
            ['钻孔', '机械钻机1#', '1次/月', '2025年5月8日', '2025年6月8日'],
            ['钻孔', '机械钻机2#', '1次/月', '2025年5月9日', '2025年6月9日'],
            ['钻孔', '机械钻机3#', '1次/月', '2025年5月10日', '2025年6月10日'],
            ['钻孔', '机械钻机4#', '1次/月', '2025年5月11日', '2025年6月11日'],
            ['钻孔', '机械钻机5#', '1次/月', '2025年5月12日', '2025年6月12日'],
            ['钻孔', '机械钻机6#', '1次/月', '2025年5月13日', '2025年6月13日'],
            ['钻孔', '机械钻机7#', '1次/月', '2025年5月14日', '2025年6月14日'],
            ['钻孔', '机械钻机8#', '1次/月', '2025年5月15日', '2025年6月15日'],
            ['钻孔', '机械钻机9#', '1次/月', '2025年5月16日', '2025年6月16日'],
            ['钻孔', '机械钻机10#', '1次/月', '2025年5月17日', '2025年6月17日'],
            ['钻孔', '验孔机', '1次/月', '2025年5月18日', '2025年6月18日'],
            ['钻孔', '研磨机1#', '1次/月', '2025年5月19日', '2025年6月19日'],
            ['钻孔', '研磨机2#', '1次/月', '2025年5月20日', '2025年6月20日'],
            ['钻孔', '研磨机3#', '1次/月', '2025年5月21日', '2025年6月21日'],
            ['电镀', '日蚀线1#', '1次/周', '2025年5月7日', '2025年5月14日'],
            ['电镀', '日蚀线2#', '1次/周', '2025年5月8日', '2025年5月15日'],
            ['电镀', 'VCP线1#', '1次/周', '2025年5月9日', '2025年5月16日'],
            ['电镀', 'VCP线2#', '1次/周', '2025年5月10日', '2025年5月17日'],
            ['电镀', '磨板机', '1次/周', '2025年5月11日', '2025年5月18日'],
            ['线路', '前处理压膜1#', '1次/周', '2025年5月8日', '2025年5月15日'],
            ['线路', '前处理压膜2#', '1次/周', '2025年5月9日', '2025年5月16日'],
            [
              '线路',
              '前处理滚涂DI蚀刻连线1#',
              '1次/周',
              '2025年5月10日',
              '2025年5月17日',
            ],
            [
              '线路',
              '前处理滚涂DI蚀刻连线2#',
              '1次/周',
              '2025年5月11日',
              '2025年5月18日',
            ],
            [
              '线路',
              '手动曝光机1#',
              '1次/15天',
              '2025年5月7日',
              '2025年5月22日',
            ],
            [
              '线路',
              '手动曝光机2#',
              '1次/15天',
              '2025年5月8日',
              '2025年5月23日',
            ],
            [
              '线路',
              'LDI曝光连线',
              '1次/15天',
              '2025年5月9日',
              '2025年5月24日',
            ],
            ['线路', '蚀刻线1#', '1次/周', '2025年5月10日', '2025年5月17日'],
            ['线路', '蚀刻线2#', '1次/周', '2025年5月11日', '2025年5月18日'],
            ['AOI', 'AOI+VRS1#', '1次/周', '2025年5月8日', '2025年5月15日'],
            ['AOI', 'AOI+VRS2#', '1次/周', '2025年5月9日', '2025年5月16日'],
            ['AOI', 'AOI+VRS3#', '1次/周', '2025年5月10日', '2025年5月17日'],
            ['菲林房', '光绘机1#', '1次/周', '2025年5月7日', '2025年5月14日'],
            ['菲林房', '光绘机2#', '1次/周', '2025年5月8日', '2025年5月15日'],
            ['菲林房', '底片检查机', '1次/周', '2025年5月9日', '2025年5月16日'],
            ['防焊', '前处理1#', '1次/周', '2025年5月10日', '2025年5月17日'],
            ['防焊', '前处理2#', '1次/周', '2025年5月11日', '2025年5月18日'],
            ['防焊', '前处理3#', '1次/周', '2025年5月12日', '2025年5月19日'],
            [
              '防焊',
              '半自动丝印机1#',
              '1次/周',
              '2025年5月13日',
              '2025年5月20日',
            ],
            [
              '防焊',
              '半自动丝印机2#',
              '1次/周',
              '2025年5月14日',
              '2025年5月21日',
            ],
            [
              '防焊',
              '半自动丝印机3#',
              '1次/周',
              '2025年5月15日',
              '2025年5月22日',
            ],
            ['防焊', '自动印刷机', '1次/周', '2025年5月16日', '2025年5月23日'],
            ['防焊', '隧道烤箱', '1次/周', '2025年5月17日', '2025年5月24日'],
            ['防焊', 'ORC曝光机1#', '1次/周', '2025年5月18日', '2025年5月25日'],
            ['防焊', 'ORC曝光机2#', '1次/周', '2025年5月19日', '2025年5月26日'],
            [
              '防焊',
              '滚涂预烤连线1#',
              '1次/周',
              '2025年5月20日',
              '2025年5月27日',
            ],
            [
              '防焊',
              '滚涂预烤连线2#',
              '1次/周',
              '2025年5月21日',
              '2025年5月28日',
            ],
            ['防焊', '科视曝光机', '1次/周', '2025年5月22日', '2025年5月29日'],
            ['防焊', '显影线1#', '1次/周', '2025年5月23日', '2025年5月30日'],
            ['防焊', '显影线2#', '1次/周', '2025年5月24日', '2025年5月31日'],
            ['文字', '手动丝印机1#', '1次/周', '2025年5月8日', '2025年5月15日'],
            ['文字', '手动丝印机2#', '1次/周', '2025年5月9日', '2025年5月16日'],
            [
              '文字',
              '手动丝印机3#',
              '1次/周',
              '2025年5月10日',
              '2025年5月17日',
            ],
            [
              '文字',
              '手动丝印机4#',
              '1次/周',
              '2025年5月11日',
              '2025年5月18日',
            ],
            [
              '文字',
              '手动丝印机5#',
              '1次/周',
              '2025年5月12日',
              '2025年5月19日',
            ],
            [
              '文字',
              '手动丝印机6#',
              '1次/周',
              '2025年5月13日',
              '2025年5月20日',
            ],
            ['文字', '隧道烤箱1#', '1次/周', '2025年5月14日', '2025年5月21日'],
            ['文字', '隧道烤箱2#', '1次/周', '2025年5月15日', '2025年5月22日'],
            ['文字', '拉网机', '1次/周', '2025年5月16日', '2025年5月23日'],
            ['文字', '上浆机', '1次/周', '2025年5月17日', '2025年5月24日'],
            ['文字', '曝光机', '1次/周', '2025年5月18日', '2025年5月25日'],
            [
              '整板压烤',
              '整板压烤1#',
              '1次/周',
              '2025年5月19日',
              '2025年5月26日',
            ],
            [
              '整板压烤',
              '整板压烤2#',
              '1次/周',
              '2025年5月20日',
              '2025年5月27日',
            ],
            ['成型', '成型机1#', '1次/月', '2025年5月8日', '2025年6月8日'],
            ['成型', '成型机2#', '1次/月', '2025年5月9日', '2025年6月9日'],
            ['成型', '成型机3#', '1次/月', '2025年5月10日', '2025年6月10日'],
            ['成型', '成型机4#', '1次/月', '2025年5月11日', '2025年6月11日'],
            ['成型', '成型机5#', '1次/月', '2025年5月12日', '2025年6月12日'],
            ['打码', '打码机', '1次/月', '2025年5月13日', '2025年6月13日'],
            ['冲型', '冲压机', '1次/月', '2025年5月14日', '2025年6月14日'],
            ['成型', '清洗线1#', '1次/月', '2025年5月15日', '2025年6月15日'],
            ['成型', '清洗线2#', '1次/月', '2025年5月16日', '2025年6月16日'],
            ['电测', '专用电测机1#', '1次/月', '2025年5月7日', '2025年6月7日'],
            ['电测', '专用电测机2#', '1次/月', '2025年5月8日', '2025年6月8日'],
            ['电测', '专用电测机3#', '1次/月', '2025年5月9日', '2025年6月9日'],
            [
              '电测',
              '专用电测机4#',
              '1次/月',
              '2025年5月10日',
              '2025年6月10日',
            ],
            [
              '电测',
              '专用电测机5#',
              '1次/月',
              '2025年5月11日',
              '2025年6月11日',
            ],
            [
              '电测',
              '专用电测机6#',
              '1次/月',
              '2025年5月12日',
              '2025年6月12日',
            ],
            [
              '电测',
              '大台面专用测试机1#',
              '1次/月',
              '2025年5月13日',
              '2025年6月13日',
            ],
            [
              '电测',
              '大台面专用测试机2#',
              '1次/月',
              '2025年5月14日',
              '2025年6月14日',
            ],
            ['电测', '飞针机1#', '1次/月', '2025年5月15日', '2025年6月15日'],
            ['电测', '飞针机2#', '1次/月', '2025年5月16日', '2025年6月16日'],
            ['电测', '飞针机3#', '1次/月', '2025年5月17日', '2025年6月17日'],
            ['电测', '飞针机4#', '1次/月', '2025年5月18日', '2025年6月18日'],
            ['电测', '飞针机5#', '1次/月', '2025年5月19日', '2025年6月19日'],
            ['AVI', 'AVI机1#', '1次/月', '2025年5月20日', '2025年6月20日'],
            ['AVI', 'AVI机2#', '1次/月', '2025年5月21日', '2025年6月21日'],
            ['OSP', 'OSP线1#', '1次/月', '2025年5月22日', '2025年6月22日'],
            ['OSP', 'OSP线2#', '1次/月', '2025年5月23日', '2025年6月23日'],
            ['包装', '真空包装机', '1次/月', '2025年5月24日', '2025年6月24日'],
          ]"
        />
      </div>
      <div class="card">
        <EqualWidthScroll
          title="工厂试产总良率"
          svgName="yield"
          iconSize="0.5rem"
          titleFontSize="0.45rem"
          :rowNum="15"
          :headerFontSize="0.25"
          :header="[
            '料号',
            '入库日期',
            '入库㎡',
            '报废㎡',
            '报废率',
            '最终良率',
          ]"
          :table-data="[
            ['02S73008', '11/10', '36.5', '1.7', '4.45%', '95.55%'],
            ['02S73008', '11/15', '36.5', '1.41', '3.72%', '96.28%'],
            ['02S73008', '12/10', '36.5', '1.2', '3.18%', '96.82%'],
            ['02S73008', '12/17', '36.5', '1.01', '2.69%', '97.31%'],
            ['02S73008', '1/10', '36.5', '0.95', '2.54%', '97.46%'],
            ['02S73008', '2/15', '36.5', '0.77', '2.07%', '97.93%'],
            ['02S73008', '3/10', '36.5', '0.76', '2.04%', '97.96%'],
            ['01S73001', '11/20', '21.47', '0.88', '3.94%', '96.06%'],
            ['01S73001', '12/2', '21.47', '0.72', '3.24%', '96.76%'],
            ['01S73001', '12/20', '21.47', '0.77', '3.46%', '96.54%'],
            ['01S73001', '1/2', '21.47', '0.67', '3.03%', '96.97%'],
            ['01S73001', '1/20', '21.47', '0.54', '2.45%', '97.55%'],
            ['01S73001', '2/8', '21.47', '0.51', '2.32%', '97.68%'],
            ['01S73001', '2/20', '21.47', '0.45', '2.05%', '97.95%'],
            ['01S73001', '3/2', '21.47', '0.41', '1.87%', '98.13%'],
            ['01S73001', '3/20', '21.47', '0.37', '1.69%', '98.31%'],
            ['02S73009', '11/30', '35.53', '1.81', '4.85%', '95.15%'],
            ['02S73009', '12/3', '35.53', '1.75', '4.69%', '95.31%'],
            ['02S73009', '12/30', '35.53', '1.21', '3.29%', '96.71%'],
            ['02S73009', '2/13', '35.53', '1.1', '3.00%', '97.00%'],
            ['02S73009', '2/21', '35.53', '1.01', '2.76%', '97.24%'],
            ['02S73009', '3/2', '35.53', '0.98', '2.68%', '97.32%'],
            ['02S73009', '3/30', '35.53', '0.76', '2.09%', '97.91%'],
            ['02S73008', '4/10', '20.38', '0.51', '2.44%', '97.56%'],
            ['02S73008', '4/20', '32.67', '0.67', '2.01%', '97.99%'],
            ['02S73008', '4/28', '19.89', '0.21', '1.04%', '98.96%'],
            ['02S73008', '5/3', '25.56', '0.42', '1.62%', '98.38%'],
            ['02S73008', '5/5', '28.87', '0.51', '1.74%', '98.26%'],
            ['02S73008', '5/8', '31.13', '0.53', '1.67%', '98.33%'],
          ]"
        />
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import Title from "@/components/Title.vue";
import EqualWidthScroll from "@/components/Scroll/EqualWidth​/index.vue";
</script>

<style scoped lang="scss">
.jiangXiN2-container {
  width: 100%;
  height: 100%;
  display: flex;
  flex-direction: column;
  box-sizing: border-box;
  background: url(@/assets/image/bg6.jpg) no-repeat center;
  background-size: cover;
  position: relative;
  overflow: hidden; //隐藏溢出内容

  &::before {
    content: "";
    position: absolute;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    background: url(@/assets/image/bg6.jpg) no-repeat center;
    background-size: cover;
    filter: blur(4px); //模糊效果
    z-index: 0; //置于底层
  }

  /* 所有直接子元素置于模糊层上方 */
  > * {
    position: relative;
    z-index: 1;
  }

  // 标题
  > div:nth-child(1) {
    flex: 2;
  }
  // 内容
  > div:nth-child(2) {
    flex: 8;
    padding: 0.3rem 0.5rem;
    box-sizing: border-box;
    overflow-y: auto; // 保持垂直滚动功能
    -webkit-overflow-scrolling: touch;
    scrollbar-width: none; // Firefox隐藏滚动条
    &::-webkit-scrollbar {
      display: none; // Chrome/Safari隐藏滚动条
    }
  }
}
.jiangXiN2-content {
  display: grid;
  gap: 0.2rem;

  // 桌面端布局
  @media (min-width: 992px) {
    grid-template-columns: repeat(2, 1fr); // 创建2等分的列布局，每列宽度相同
    grid-auto-rows: 1fr; // 所有行自动等高
  }
  @media (max-width: 992px) {
    grid-auto-flow: row;
    grid-template-columns: 1fr;
    grid-auto-rows: 45%;
  }
}

.card {
  overflow: hidden; // 添加overflow防止图表溢出
}
</style>
